## Plan結果

**Plan: 2 to add, 0 to change, 0 to destroy.**



<details><summary>リソースごとの変更内容の要約はこちら</summary>

```diff

@@ Create @@
+ google_storage_bucket.test_bucket
+ google_storage_bucket.test_bucket_japan

```

</details>


<details><summary>planの差分詳細はこちら</summary>

```hcl

  # google_storage_bucket.test_bucket will be created
  + resource "google_storage_bucket" "test_bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = "test-bucket-for-terraform-example-12345"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket.test_bucket_japan will be created
  + resource "google_storage_bucket" "test_bucket_japan" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = "test-bucket-for-terraform-example-678910"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label add-or-update: POST https://api.github.com/repos/dd-japan/ctf-terraform/issues/2/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]


[GitHub Actions上の実行詳細へのリンク](https://github.com/dd-japan/ctf-terraform/actions/runs/15339527463)

<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":2,"Program":"tfcmt","SHA1":"a9bb81adf9bf1ac832c153ef377205abf4350e85","Vars":{},"WorkflowName":"terraform plan"} -->